location_dictionary = {
    "請洽系所辦": "",
    "": "",
    
    "博雅": "國立臺灣大學博雅教學館",
    "共": "國立臺灣大學共同教學館",
    "新": "國立臺灣大學新生教學館",
    "普": "國立臺灣大學普通教學館",
    "綜": "國立臺灣大學綜合教學館",
    
    "外教": "台灣大學文學院外語教學暨資源中心",
    "文": "國立臺灣大學文學院",
    "水源階梯": "台大水源校區階梯教室",
    "哲研討室一": "水源校區行政大樓",
    "哲研討室二": "水源校區行政大樓",
    "哲研討室三": "水源校區行政大樓",
    "水源人": "水源校區行政大樓",
    "圖資資訊室": "國立台灣大學圖書資訊學系",
    "圖資視聽室": "國立台灣大學圖書資訊學系",
    "圖資會議室": "國立台灣大學圖書資訊學系",
    "圖資編目室": "國立台灣大學圖書資訊學系",
    
    "管一": "臺灣大學管理學院一號館",
    "公衛": "國立台灣大學公共衛生學院",
    
    "排球場": "臺大排球場",
    "土": "國立臺灣大學土木工程學系系館",
    "土研": "國立台灣大學土木研究大樓",
    "農化二": "國立臺灣大學農化新館/第二行政大樓",
    "農化一": "國立臺灣大學農業化學系",
    "食科": "國立臺灣大學食品科技研究所",
    "農工": "國立臺灣大學五號館",
}